{
    "about": "Software Engineer specializing in React.js and Next.js with 4 years of experience building scalable, functional, and maintainable web applications. Experienced in developing reusable components, setting up design systems, and implementing efficient UI logic. Strong background in building real-world, role-based systems using modern frontend stacks and collaborating with cross-functional teams in agile environments.",
    "skills": [
        "JavaScript",
        "ReactJS",
        "NextJS",
        "Tailwind CSS",
        "Bootstrap",
        "MaterialUI",
        "Git",
        "Agile Scrum Methodologies"
    ],
     "projects": [
    {
      "title": "Nakhlah – Arabic Language Learning Platform (Fintech Hub Limited)",
      "description": "Developed core frontend features using Next.js, Redux, and Zustand. Managed global state, optimized data flow, and reduced re-renders by 30%, improving UX by 50%. Collaborated on scalable UI and business logic across user and admin modules.",
      "link": "https://nakhlah-user1.vercel.app/"
    },
         {
      "title": "RecruitGenie – Smart Recruitment Platform (LEADS Corporation Limited)",
      "description": "Built core frontend of RecruitGenie with React, focusing on reusable layouts, API integration, and efficient state handling. Led development of exam engine and cheating-prevention system. Delivered 80% of the UI, significantly improving the HR recruitment workflow.",
      "link": "#"
    },
 {
      "title": "IMS Services - Student Consultency Service (Freelancing)",
      "description": "Built with NextJS. Used NextJS Api for light backend tasks. University searching faster then ever. Content management working smoothly.",
      "link": "#"
    },
 {
      "title": "True Light - A Islamic Life style app (Personal)",
      "description": "Built core frontend of RecruitGenie with React, focusing on reusable layouts, API integration, and efficient state handling. Led development of exam engine and cheating-prevention system. Delivered 80% of the UI, significantly improving the HR recruitment workflow.",
      "link": "#"
    }
  ],
    "experience": [
        {
            "title": "Software Engineer",
            "company": "FintechHub Limited",
            "duration": "July 2024 - April 2025",
            "description": "Worked on Nakhlah - a language learning app. I contributed to Front-end development using NextJS. "
        },
        {
            "title": "Software Engineer",
            "company": "LEADS Corporation Limited",
            "duration": "June 2021 - June 2024",
            "description": "I worked on their recruitment system. After benchmarking, I sketched the UI and system flow. Then, using the ReactJS library, I developed most of the frontend. "
        }
    ],
    "education": [
        {
            "degree": "B.Sc. in Software Engineering",
            "institution": "Daffodil International University",
            "year": "2019",
            "description": "Focused on advanced programming and software engineering principles."
        }
    ],
    "gallery": {
        "data": [
            {
                "project_name": "Nakhlah",
                "images": [
                    "./public/image/nakhlah/image1.png",
                    "./public/image/nakhlah/image2.png",
                    "./public/image/nakhlah/image3.png"
                ]
            }
        ]
    }
}
